---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TrySmallerBarType
source: html/adbb883a-d828-7694-522c-53ce6d42a5e8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.TrySmallerBarType Property

Rebar Bend Diameter is too large. Try a smaller Bar Type.

## Syntax (C#)
```csharp
public static FailureDefinitionId TrySmallerBarType { get; }
```